ttrftech/LPC4370SDR-FM/src/main.c
struct {
	uint32_t last;
} fm_demod_state;

void fm_demod()
{
	uint32_t *src = (uint32_t *)DEMOD_BUFFER;
	int16_t *dest = (int16_t *)AUDIO_BUFFER;
	int32_t length = DEMOD_BUFFER_SIZE / sizeof(uint32_t);
	int i;

	uint32_t x0 = fm_demod_state.last;
	for (i = 0; i < length; i++) {
		uint32_t x1 = src[i];
		int32_t d = __SMUSDX(__SSUB16(x1, x0), x1);
		int32_t n = __SMUAD(x1, x1) >> 12;
		int16_t y = d / n;
		dest[i] = y;
		x0 = x1;
	}
	fm_demod_state.last = x0;
}

#define RESAMPLE_NUM_TAPS	128

q15_t resample_fir_coeff_even[RESAMPLE_NUM_TAPS] = {
		  0,    0,    1,    2,    3,    4,    6,    7,    9,   11,   12,
		 14,   15,   17,   18,   18,   18,   17,   15,   13,    9,    4,
		 -1,   -7,  -15,  -24,  -33,  -43,  -53,  -63,  -73,  -82,  -90,
		-96, -100, -102, -101,  -97,  -89,  -78,  -62,  -42,  -18,    9,
		 42,   79,  120,  163,  210,  259,  310,  362,  414,  465,  515,
		563,  608,  649,  686,  717,  743,  763,  777,  784,  784,  777,
		763,  743,  717,  686,  649,  608,  563,  515,  465,  414,  362,
		310,  259,  210,  163,  120,   79,   42,    9,  -18,  -42,  -62,
		-78,  -89,  -97, -101, -102, -100,  -96,  -90,  -82,  -73,  -63,
		-53,  -43,  -33,  -24,  -15,   -7,   -1,    4,    9,   13,   15,
		 17,   18,   18,   18,   17,   15,   14,   12,   11,    9,    7,
		  6,    4,    3,    2,    1,    0,    0};
q15_t resample_fir_coeff_odd[RESAMPLE_NUM_TAPS] = {
		  0,    0,    1,    2,    4,    5,    6,    8,   10,   12,   13,
		 15,   16,   17,   18,   18,   17,   16,   14,   11,    7,    1,
		 -4,  -11,  -19,  -28,  -38,  -48,  -58,  -68,  -77,  -86,  -93,
		-98, -101, -102, -100,  -94,  -84,  -70,  -53,  -31,   -4,   25,
		 60,   99,  141,  187,  235,  285,  336,  388,  440,  490,  539,
		586,  629,  668,  702,  731,  754,  771,  781,  784,  781,  771,
		754,  731,  702,  668,  629,  586,  539,  490,  440,  388,  336,
		285,  235,  187,  141,   99,   60,   25,   -4,  -31,  -53,  -70,
		-84,  -94, -100, -102, -101,  -98,  -93,  -86,  -77,  -68,  -58,
		-48,  -38,  -28,  -19,  -11,   -4,    1,    7,   11,   14,   16,
		 17,   18,   18,   17,   16,   15,   13,   12,   10,    8,    6,
		  5,    4,    2,    1,    0,    0,    0};

// 312.5kHz * 2/13 -> 48.076923kHz

struct {
	int index;
	int current;
} resample_state;

void resample_fir_filter()
{
	const uint32_t *coeff;
	const uint32_t *src = (const uint32_t *)DEMOD_STATE;
	int32_t tail = DEMOD_BUFFER_SIZE;
	int idx = resample_state.index;
	uint32_t acc;
	uint32_t x0, c0, x1, x2;
	int i, j;
	int cur = resample_state.current;
	uint16_t *dest = (uint16_t *)AUDIO_BUFFER;

	while (idx < tail) {
		int cls = idx & 0x3;
		i = idx >> 2;

		switch (cls) {
		case 0:
		case 2:
			coeff = (uint32_t*)resample_fir_coeff_even;
			break;
		case 1:
		case 3:
			coeff = (uint32_t*)resample_fir_coeff_odd;
			break;
		}

		acc = 0;
		switch (cls) {
		case 0:
		case 1:
			for (j = 0; j < RESAMPLE_NUM_TAPS / 2; ) {
				x0 = src[i+j];
				c0 = coeff[j++];
				acc = __SMLAD(x0, c0, acc);
			}
			break;
		case 2:
		case 3:
			x0 = src[i];
			for (j = 0; j < RESAMPLE_NUM_TAPS / 2; ) {
				c0 = coeff[j++];
				x2 = src[i+j];
				x1 = __PKHBT(x2, x0, 0);
				acc = __SMLADX(x1, c0, acc);
				x0 = x2;
			}
			break;
		}
		dest[cur++] = __SSAT((acc >> 15), 16);
		cur %= AUDIO_BUFFER_SIZE / 2;
		//dest[cur++] = __PKHBT(__SSAT((acc0 >> 15), 16), __SSAT((acc1 >> 15), 16), 16);
		idx += 13;
	}

	resample_state.current = cur;
	resample_state.index = idx - tail;
	uint32_t *state = (uint32_t *)DEMOD_STATE;
	src = &src[tail / sizeof(*src)];
	for (i = 0; i < DEMOD_STATE_SIZE / sizeof(uint32_t); i++) {
		//*state++ = *src++;
	    __asm__ volatile ("ldr r0, [%0], #+4\n" : : "r" (src) : "r0");
	    __asm__ volatile ("str r0, [%0], #+4\n" : : "r" (state));
	}
}


void DMA_IRQHandler (void)
{
  if (LPC_GPDMA->INTERRSTAT & 1)
  {
    LPC_GPDMA->INTERRCLR = 1;
  }

//#define MEMCPY __aeabi_memcpy8

  if (LPC_GPDMA->INTTCSTAT & 1)
  {
	LPC_GPDMA->INTTCCLEAR = 1;
	//LPC_GPDMA->C0CONFIG |= (1 << 18); //halt further requests

	//TOGGLE_MEAS_PIN_3();
    const int length = CAPTUREBUFFER_SIZE / 2;
	SET_MEAS_PIN_3();
    if ((capture_count & 1) == 0) {
    	//MEMCPY(DEST_BUFFER, CAPTUREBUFFER, length);
    	cic_decimate_i(&cic_i, CAPTUREBUFFER, length);
    	cic_decimate_q(&cic_q, CAPTUREBUFFER, length);
    } else {
    	//MEMCPY(DEST_BUFFER + length, CAPTUREBUFFER + length, length);
    	//MEMCPY(DEST_BUFFER, CAPTUREBUFFER + length, length);
    	cic_decimate_i(&cic_i, CAPTUREBUFFER + length, length);
    	cic_decimate_q(&cic_q, CAPTUREBUFFER + length, length);
    }
	fir_filter_iq();
	fm_demod();
	resample_fir_filter();
    CLR_MEAS_PIN_3();
    capture_count ++;
  }
}

static void VADC_SetupDMA(void)
{
  int i;
  uint32_t transSize;

  NVIC_DisableIRQ(DMA_IRQn);
  LPC_GPDMA->C0CONFIG = 0;

  /* clear all interrupts on channel 0 */
  LPC_GPDMA->INTTCCLEAR = 0x01;
  LPC_GPDMA->INTERRCLR = 0x01;

  /* Setup the DMAMUX */
  LPC_CREG->DMAMUX &= ~(0x3<<(VADC_DMA_WRITE*2));
  LPC_CREG->DMAMUX |= 0x3<<(VADC_DMA_WRITE*2);  /* peripheral 7 vADC Write(0x3) */
  LPC_CREG->DMAMUX &= ~(0x3<<(VADC_DMA_READ*2));
  LPC_CREG->DMAMUX |= 0x3<<(VADC_DMA_READ*2);  /* peripheral 8 vADC read(0x3) */

  LPC_GPDMA->CONFIG = 0x01;  /* Enable DMA channels, little endian */
  while ( !(LPC_GPDMA->CONFIG & 0x01) );

  // The size of the transfer is in multiples of 32bit copies (hence the /4)
  // and must be even multiples of FIFO_SIZE.
  transSize = CAPTUREBUFFER_SIZE / DMA_NUM_LLI_TO_USE / 4;

  for (i = 0; i < DMA_NUM_LLI_TO_USE; i++)
  {
    DMA_Stuff[i].SrcAddr = VADC_DMA_READ_SRC;
    DMA_Stuff[i].DstAddr = ((uint32_t)CAPTUREBUFFER) + transSize*4*i;
    DMA_Stuff[i].NextLLI = (uint32_t)(&DMA_Stuff[(i+1)%DMA_NUM_LLI_TO_USE]);
    DMA_Stuff[i].Control = (transSize << 0) |      // Transfersize (does not matter when flow control is handled by peripheral)
                           (0x2 << 12)  |          // Source Burst Size
                           (0x2 << 15)  |          // Destination Burst Size
                           //(0x0 << 15)  |          // Destination Burst Size
                           (0x2 << 18)  |          // Source width // 32 bit width
                           (0x2 << 21)  |          // Destination width   // 32 bits
                           (0x1 << 24)  |          // Source AHB master 0 / 1
                           (0x0 << 25)  |          // Dest AHB master 0 / 1
                           (0x0 << 26)  |          // Source increment(LAST Sample)
                           (0x1 << 27)  |          // Destination increment
                           (0x0UL << 31);          // Terminal count interrupt disabled
    //log_i("DMA_Stuff[%d] on address %#x, destination %#x, transfer size %#x (%d)\r\n", i, (uint32_t)&DMA_Stuff[i], DMA_Stuff[i].DstAddr, transSize, transSize);
  }

