ttrftech/LPC4370SDR-FM/src/main.c
  VADC_SetupDMA();
}

static void VADC_Start(void)
{
	capture_count = 0;
	LPC_VADC->TRIGGER = 1;
}

static void VADC_Stop(void)
{
  NVIC_DisableIRQ(DMA_IRQn);
  NVIC_DisableIRQ(VADC_IRQn);

  // disable DMA
  LPC_GPDMA->C0CONFIG |= (1 << 18); //halt further requests
/*
  // power down VADC
  LPC_VADC->POWER_CONTROL = 0;

  // Clear FIFO
  LPC_VADC->FLUSH = 1;

  // Reset the VADC block
  RGU_SoftReset(RGU_SIG_VADC);
  while(RGU_GetSignalStatus(RGU_SIG_VADC));
*/
}

static void priorityConfig()
{
  // High - Copying of samples
  NVIC_SetPriority(DMA_IRQn,   ((0x01<<3)|0x01));

  // Low - Communication
  NVIC_SetPriority(USB0_IRQn, ((0x03<<3)|0x01));
  NVIC_SetPriority(USB1_IRQn, ((0x03<<3)|0x01));
  NVIC_SetPriority(I2C0_IRQn, ((0x03<<3)|0x01));
}

int main(void) {
	setup_systemclock();
    setup_pll0audio(PLL0_MSEL, PLL0_NSEL, PLL0_PSEL);
    priorityConfig();

    int32_t x = __SMUSD(0xe7acf59f, 0xdefe32f8);

    printf("Hello World: %x\n", x);
    GPIO_SetDir(0,1<<8, 1);
	GPIO_ClearValue(0,1<<8);

	scu_pinmux(0x6, 11, SETTINGS_GPIO_OUT, FUNC0); //GPIO3[7], available on J7-14
	LPC_GPIO_PORT->DIR[3] |= (1UL << 7);
	LPC_GPIO_PORT->SET[3] |= (1UL << 7);

	//ConfigureNCOTable(2500000 / 20000); // 2.5MHz
	//ConfigureNCOTable(2500000 / 5000); // 2.5MHz
	//ConfigureNCOTable(1000000 / 5000); // 1MHz
	//ConfigureNCOTable(420000 / 5000); // 400kHz
	ConfigureNCOTable(420000 / 10000); // 400kHz
	//ConfigureNCOTable(0); // 0MHz
	memset(&cic_i, 0, sizeof cic_i);
	memset(&cic_q, 0, sizeof cic_q);
	//arm_fir_init_q15(&fir, FIR_NUM_TAPS, fir_coeff, fir_state, FIR_BLOCK_SIZE);

	VADC_Init();

	/* wait 5 msec */
	emc_WaitUS(5000);

	capture_count = 0;
	VADC_Start();
    //volatile static int i = 0 ;

    while(1) {
        //i++ ;
        if ((capture_count / 1024) % 2) {
        	//int i;
        	LPC_GPDMA->C0CONFIG |= (1 << 18); //halt further requests
            //int length = CAPTUREBUFFER_SIZE / 2;
        	//memset(DEST_BUFFER, 0, DEST_BUFFER_SIZE);
            //cic_decimate(&cic1, CAPTUREBUFFER, length);

        	GPIO_SetValue(0,1<<8);
        	SET_MEAS_PIN_3();
        	fir_filter_iq();
        	fm_demod();
        	resample_fir_filter();
#if 0
    		q15_t *src = I_DEST_BUFFER;
    		q15_t *dst = I_FIR_BUFFER;
        	for (i = 0; i < FIR_NUM_BLOCKS; i++) {
        		arm_fir_fast_q15(&fir, src, dst, FIR_BLOCK_SIZE);
        		src += FIR_BLOCK_SIZE;
        		dst += FIR_BLOCK_SIZE;
        	}
#endif
        	CLR_MEAS_PIN_3();
        	GPIO_SetValue(0,1<<8);

        } else
        	GPIO_ClearValue(0,1<<8);
        //if ((i & 0x1fffff) == 0x100000)
        //	printf("%d\n", i);
    }
	VADC_Stop();
    return 0 ;
}
